#+TITLE: Bellini's LabBook
#+AUTHOR: Lucas e Tais
#+LATEX_HEADER: \usepackage[margin=2cm,a4paper]{geometry}
#+STARTUP: overview indent
#+TAGS: Lucas(L) Tais(T) noexport(n) deprecated(d)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+SEQ_TODO: TODO(t!) STARTED(s!) WAITING(w!) | DONE(d!) CANCELLED(c!) DEFERRED(f!)

* 2015-09-15 Planning                                            :Lucas:Tais:

|---------+--------------------------------------------------|
| Sep/Oct | Complete Java Simulator for the Paje file format |
| Nov/Dec | Database modeling for Paje traces                |
| Jan/Feb | Experimentation and Performance Evaluation       |
| Mar/Jun | Write the thesis                                 |
|---------+--------------------------------------------------|

* 2015-09-15 Structure / Draft of TCC                            :Lucas:Tais:

1. Introduction (3 pages max)
   + Context (current scenario with pajeng c++)
   + Motivation
2. Basic Concepts? (5 pages max)
   + JavaCC?
   + Ferramentas de análise de desempenho
3. PajeNG
   + How it is used by others (pjdump, etc)
   + Description of how it works internally
   + The problems with the current approach
     + Focus on your contribution
4. Java Simulator
   + JavaCC / Perf. Eval. against others / Why JavaCC?
5. Database modeling
6. Perf. Eval. / Experimentation / Results
7. Conclusion
* 2016-02-15 Performance issues                                  :Lucas:Tais:

Tais report that her solution to DB insertion has severe performance
issues. The initial solution was that every *pop* event become a
insert. That didn't work, so Tais optimize with an alternative
implementation which uses StringBuffer and create many insert commands
on that object. They only get executed at the end of the parsing. Tais
was never capable to evaluate if this solution is faster because
execution runs out of memory.

So, by looking into this SO entry:

+ http://stackoverflow.com/questions/11389449/performance-of-mysql-insert-statements-in-java-batch-mode-prepared-statements-v

We propose a new attempt to solve the performance problem. The SO
entry proposes four solutions, we will take the last one, which seems
the best. To correctly adapt this fourth solution to Tais's case, we
should limit the batch size to something acceptable. If not, we will
run out of memory again because the (usual) trace file size is just
too big.

So, next plans are like this:
- Tais will limit the size of the batch considering the number of
  operations on it.
- Each batch will contain five StringBuffers, one for each paje type
  (Container, State, Link, Variable, and Event).
- Every time something gets added to one of these string buffers, the
  operation count of the batch gets increased.
- When the batch size reaches a (configurable) value X, the code
  executes the batch, zero it, and we start again filling.
- Tais will do a quick performance analysis by changing the
  (configurable) value X to see the impact in execution time.

How to know the baseline:
- Find out how long it take to only parse with the Java version. You
  can do that by checking out the *no-db* branch.


* 2016-02-26 Meeting with Tais                                   :Lucas:Tais:

How to get it working.

Install mysql, root password should be root:

#+begin_src sh :results output :session :exports both
sudo apt-get install mysql-server
#+end_src

Run the =pajeDB.sql= to create the tables.

Fix =compile.sh= to have the correct CLASSPATH.

Problems found:
- Program does not terminate
- 


_Plugin_:

- Today, SQL commands are created in the middle of the PajeSimulator
  source code. Moreover, the different strategies (searching for
  performance) are commented in the same source code. This leads to
  design that is difficult to manage, and also hard to evaluate the
  different performance options.

- So my suggestion is to create a plugin for each type of output from
  the simulator. You will go back in time so the Paje Simulator source
  code is as clean as possible, and instrument this code to contain
  specific calls when something should be registered (such as the pop,
  the end links, and so on).

- The plugin will be called in this different instrumentation points
  and do what it was design to do. A first plugin to be implemented is
  the one with the SQL insert commands.

- Alternative versions to look for better performance should be
  implemented as other plugins, that could be subclasses (derived)
  from the initial one, if there is some functionality sharing between
  them.

- Plugins already proposed by Tais:
  - Multiple batches, but are handle sequentially
  - Multiple batches, but with threads
  - Print the SQL commands to output

- Class model for this plugin story
  - PajePlugin
    - PajePluginMultipleBatchesSequential
      - PajePluginMultipleBatchesThreads
    - PajePluginPrintSQLCommandsToOutput
    - PajePluginNull
    - PajePluginOutputPJDUMP

- Clean PajeSimulator
  - Create PajePlugin

- Exhaustive list of instrumentations points for the plugins
  - All types and values definitions
  - All create containers
  - Pops
  - Events
  - Add, Sub, Set variables
  - Start and end of links

* 2016-02-28 Starting Aiyra                                            :Tais:
The new implementation with plugins will be called Aiyra.
The code is [[https://github.com/taisbellini/aiyra][here]].
There are only two classes with a print informing which plugin was chosen.

** How to use

#+begin_src sh :results output :session :exports both
java br.ufrgs.inf.tlbellini.PajeGrammar -f <path-to-trace-file> \
                                        -m <comment (optional)> \
                                        -p <plugin (default: null)> \
                                        - ... <options for the specific plugin>
#+end_src

** Plugins available

- "pjdump": it outputs a CSV based on the =pj_dump= format
- "mysql" : saves the data in a MySQL database

** References
Command line reader:
http://www.javaworld.com/article/2074849/core-java/processing-command-line-arguments-in-java--case-closed.html

Memory Usage: 
http://www.vogella.com/tutorials/JavaPerformance/article.html#runtimeinfo_memory
https://developer.apple.com/library/mac/documentation/Performance/Conceptual/ManagingMemory/Articles/VMPages.html
** Performance
commit: "create poc of integration of plugins and the Options package"
- scorep-cg.A.64.paje - 2.1GB - 367918ms
- scorep-lu.B.64.paje - 776.7MB - 77917ms
- traces-16Mega.paje - 16MB - 1500ms


** Plugins
PajeDumpPlugin: using System.out.println which is bad in performance,
but I couldn't find other solution that would not giva e heap space
problem to big files. The current solution implies the user to decide
how many lines will be in the dump. The higher the number, better the
performance but more memory is used. In my computer, I have
JavaHeapSpace problem. 


* 2016-02-29 Adding PajeInsertDBPlugin                                 :Tais:
** Notes
-When destroy container: just need to insert states
    - Event: inserts when it happens
    - Var: inserts when it is created or updated
    - Link: inserts when it is complete
* 2016-03-15 How to Use 
** DB Plugin 

1) Install MySQL and MySQL Workbench 

2) Create an instance (local or in a server) and choose a name and password to it. Use port 3306. 

3) execute pajeDB.sql script in the created instance.

Now you have a database called "paje". 

Execute the simulator passing the server name (-s) name (-u) and password (-pwd) of the instance you created in step 2. Defaults are "localhost", "root", "root". 


#+begin_src sh :results output :session :exports both
java br.ufrgs.inf.tlbellini.PajeGrammar -f <path-to-trace-file> \
                                        -m <comment (optional)> \
                                        -p mysql \
                                        -s <server-name> \
                                        -u <username> \
                                        -pwd <password> \
#+end_src

** PajeDump Plugin

Execute:

#+begin_src sh :results output :session :exports both
java br.ufrgs.inf.tlbellini.PajeGrammar -f <path-to-trace-file> \
                                        -m <comment (optional)> \
                                        -p pjdump \
                                        -l <lines-per-dump (default: 100000)>
#+end_src

"lines-per-dump" is the number of lines that will be printed each time. Higher numbers takes less time but use more memory. 

* 2016-03-15 - How to Create a Plugin
In order to create a new plugin you'll need to: 
MODIFY OptionsHandler.java in br.ufrgs.inf.tlbellini;
CREATE a NEW class in br.ufrgs.inf.tlbellini.plugins that EXTENDS PajePlugin class. It can also extend any other plugin if they have many similarities. 

MODIFY OptionsHandler:
1) *If your plugin DOES NOT NEED an extra argument, SKIP this instruction*

In the OptionsHandler constructor, add the new argument as follows: 
  
   opt.getSet().addOption("<alias>", Options.Separator.<SEPARATOR>, Options.Multiplicity.<MULTIPLICITY>);

   <alias> = the alias to identify the argument
   <SEPARATOR> = COLON, EQUALS, BLANK, NONE
   <MULTIPLICITY> = ONCE, ONCE_OR_MORE, ZERO_OR_ONE, ZERO_OR_MORE

2) Explain your new entry (if any) and plugin in printOptionsHelper() method.
3) In pluginHandler() method, add a "case" to your plugin. Make all the assignments you need to do and initialize it. 
   to get the value given for the argument: 
     opt.getSet().getOption("<alias").getResultValue(0)
   to check if the value was set: 
     opt.getSet().isSet("<alias>")
   to initialize:
     PajeGrammar.plugin = new YourPluginClass(...);

CREATE NEW CLASS: 

1) Create a class that extends PajePlugin or any Plugin available. 
   
Instrumentation Points:

* 2016-03-29 Meeting with Tais                                   :Lucas:Tais:

Performance Evalution

- DB Insertion Plugin
  - _Multiple batches, but are handle sequentially_

- What is the experimental configuration?
  - Software and hardware
  - Software: everything in the same machine

_What we shall measure to evaluate?_

- *Batch size*
  - Input size
    - Lucas will provide a trace file generator
      128K, 128M, 1G
  - Batch size in operations
    - 128
    - 256
    - 512
    - 1024
    - 2048
    - ...
  - Four platform configurations
    - _luiza_ Tais' personal notebook (Local/Mac) - Tais
    - _guarani_ Lucas' guarani (Linux/Local) - Lucas
    - _orion_ Orion (Linux/Local) - Tais
    - _hptais_ Tais' work notebook is client (Windows), guarani is server (Linux) (Remote) - Tais
      - Find out the interconnection topology
      - The latency and the bandwidth of the network (limits)
        - Find out a metric to see if you reach the network limit

- What to measure
  - Global execution time
    - Only simulation
    - Only insertion
  - Global memory occupation
  |----------------------+---------------------+--------------------------|
  | Only Simulation Time | Only Insertion Time | Global Memory Occupation |
  |----------------------+---------------------+--------------------------|

  - How batches have been generated
    - When a batch has started, when it has ended
    - Format suggestion for dumping this kind of information
      |--------------+------------+----------+---------------+------------------------------|
      | Batch number | Start time | End time | Size in bytes | Size in number of operations |
      |--------------+------------+----------+---------------+------------------------------|

- *Comparison against C++*
  - Measure only the simulation time
    - Null plugin against
      - =pj_dump= with =-q=
      - =pj_dump= with =-q= and =-f= (for flex)
  - Input size
    -  128K, 128M, 1G
  - _Platforms_
    - Tais' personal notebook (Local) - Tais
    - Lucas' guarani (Local) - Lucas
    - Orion (Local) - Tais
  |----------------------|
  | Only simulation time |
  |----------------------|

_Experimental Design_

- How many replications? 30.
- Statistical framework: gaussian distribution, with mean, sd, se
  - se: =3*sd/sqrt(n)=, CI of 99.7% assuming gaussian
  - no statistical tests (t-test), because we'll use plots to analyze
    with mean+se and mean-se
- See Jain 1991, Part III, Chapter 16.

- _Factors_
  - Input size
    - small, big
  - Batch size
    - small, big
  - Platform
    - two platforms wildly different

- _Real Factors and levels_ (see chapter 23 on page 381)
  - input size: 3
  - batch size: 6
  - platforms: 4
- 3*6*4
  #+begin_src R :results output :session :exports both
  input_size = 3;
  batch_levels = 6;
  platforms = 4;
  r=30;
  total_number_of_experiments = input_size*batch_levels*platforms*r
  minutes_each = 15;
  total_number_of_experiments * minutes_each / 60 / 24
  #+end_src

  #+RESULTS:
  : [1] 22.5

_C++ Comparison Analysis_

- Version
  - Ayira
  - pajeng with flex
  - pajeng without flex
- Input size
- 30 replications

|------------+---------|
| Input Size | Version |
|------------+---------|

_Changes to the *mysql* plugin_
- add a new parameter to tell the batch size (default is size of input)
- add a flag (disable by default) to tell the plugin to measure each batch execution
  - a vector will be used to keep this in memory during execution;
    only at the end that this is dumped to CSV
  - generates a new file that has the CSV info in the beggining of
    each line and then the following information you have measured
  |--------------+------------+----------+---------------+------------------------------|
  | Batch number | Start time | End time | Size in bytes | Size in number of operations |
  |--------------+------------+----------+---------------+------------------------------|

_How to measure memory utilization_
- MemoryUsage class in Java, check the used() method
- Compare against top (the column that indicates the virtual memory allocated)
* 2016-03-29 DoE for C++ Comparison                                   :Lucas:

The C++ Comparison has two factors: _version_ and _input_, each one with
three levels. For version, the levels are _ayira_, _pj_, _pjflex_. For
input, the levels are small (128K), medium (131072K, or 128M), and big
(1048576K or 1G). We shall use 30 replications randomizing experiments
to reduce external interference. Two things are measured: the
execution time represents the _simulation time_, the _platform_ is the
identification of the platform where measurements took place. Platform
can be one of _luiza_, _guarani_, _orion_, _hptais_ (TODO: rename this last one).

To understand what functions below do, check:
- https://cran.r-project.org/web/packages/DoE.base/DoE.base.pdf
You'll need the =DoE.base= R package.

#+begin_src R :results output silent :session :exports none
  require(DoE.base);
  Cpp_Comparison <- fac.design (
           nfactors=2,
           replications=30,
           repeat.only=FALSE,
           blocks=1,
           randomize=TRUE,
           seed=10373,
           nlevels=c(3,3),
           factor.names=list(
                version=c("aiyra","pj","pjflex"),
                input=c("small", "medium", "big")));

  export.design(Cpp_Comparison,
                path="designs",
                filename=NULL,
                type="csv",
                replace=TRUE,
                response.names=c("time","platform"));
#+end_src

Check the file =Cpp_Comparison.csv= in the =designs= directory. It
contains your experimental design for running the Cpp Comparison
experimental session. Each line is a experiment. You should run each
experiment following the factor configuration, providing the execution
time in the last column.

You can read that CSV with:

#+begin_src R :results output :session :exports both
csv <- read.csv("designs/Cpp_Comparison.csv");
csv;
#+end_src

#+RESULTS:
#+begin_example
    name run.no.in.std.order run.no run.no.std.rp version  input time platform
1      1                   4      1          4.10   ayira medium   NA       NA
2      2                   9      2          9.10  pjflex    big   NA       NA
3      3                   2      3          2.10      pj  small   NA       NA
4      4                   5      4          5.10      pj medium   NA       NA
5      5                   7      5          7.10   ayira    big   NA       NA
6      6                   6      6          6.10  pjflex medium   NA       NA
7      7                   3      7          3.10  pjflex  small   NA       NA
8      8                   1      8          1.10   ayira  small   NA       NA
9      9                   8      9          8.10      pj    big   NA       NA
10    10                   6     10          6.20  pjflex medium   NA       NA
11    11                   7     11          7.20   ayira    big   NA       NA
12    12                   8     12          8.20      pj    big   NA       NA
13    13                   4     13          4.20   ayira medium   NA       NA
14    14                   3     14          3.20  pjflex  small   NA       NA
15    15                   5     15          5.20      pj medium   NA       NA
16    16                   2     16          2.20      pj  small   NA       NA
17    17                   9     17          9.20  pjflex    big   NA       NA
18    18                   1     18          1.20   ayira  small   NA       NA
19    19                   2     19          2.30      pj  small   NA       NA
20    20                   9     20          9.30  pjflex    big   NA       NA
21    21                   6     21          6.30  pjflex medium   NA       NA
22    22                   1     22          1.30   ayira  small   NA       NA
23    23                   3     23          3.30  pjflex  small   NA       NA
24    24                   4     24          4.30   ayira medium   NA       NA
25    25                   5     25          5.30      pj medium   NA       NA
26    26                   7     26          7.30   ayira    big   NA       NA
27    27                   8     27          8.30      pj    big   NA       NA
28    28                   6     28          6.40  pjflex medium   NA       NA
29    29                   7     29          7.40   ayira    big   NA       NA
30    30                   5     30          5.40      pj medium   NA       NA
31    31                   8     31          8.40      pj    big   NA       NA
32    32                   1     32          1.40   ayira  small   NA       NA
33    33                   4     33          4.40   ayira medium   NA       NA
34    34                   9     34          9.40  pjflex    big   NA       NA
35    35                   3     35          3.40  pjflex  small   NA       NA
36    36                   2     36          2.40      pj  small   NA       NA
37    37                   2     37          2.50      pj  small   NA       NA
38    38                   6     38          6.50  pjflex medium   NA       NA
39    39                   9     39          9.50  pjflex    big   NA       NA
40    40                   3     40          3.50  pjflex  small   NA       NA
41    41                   8     41          8.50      pj    big   NA       NA
42    42                   4     42          4.50   ayira medium   NA       NA
43    43                   5     43          5.50      pj medium   NA       NA
44    44                   7     44          7.50   ayira    big   NA       NA
45    45                   1     45          1.50   ayira  small   NA       NA
46    46                   4     46          4.60   ayira medium   NA       NA
47    47                   5     47          5.60      pj medium   NA       NA
48    48                   2     48          2.60      pj  small   NA       NA
49    49                   9     49          9.60  pjflex    big   NA       NA
50    50                   3     50          3.60  pjflex  small   NA       NA
51    51                   7     51          7.60   ayira    big   NA       NA
52    52                   8     52          8.60      pj    big   NA       NA
53    53                   6     53          6.60  pjflex medium   NA       NA
54    54                   1     54          1.60   ayira  small   NA       NA
55    55                   7     55          7.70   ayira    big   NA       NA
56    56                   1     56          1.70   ayira  small   NA       NA
57    57                   2     57          2.70      pj  small   NA       NA
58    58                   5     58          5.70      pj medium   NA       NA
59    59                   4     59          4.70   ayira medium   NA       NA
60    60                   8     60          8.70      pj    big   NA       NA
61    61                   9     61          9.70  pjflex    big   NA       NA
62    62                   6     62          6.70  pjflex medium   NA       NA
63    63                   3     63          3.70  pjflex  small   NA       NA
64    64                   8     64          8.80      pj    big   NA       NA
65    65                   7     65          7.80   ayira    big   NA       NA
66    66                   5     66          5.80      pj medium   NA       NA
67    67                   6     67          6.80  pjflex medium   NA       NA
68    68                   9     68          9.80  pjflex    big   NA       NA
69    69                   1     69          1.80   ayira  small   NA       NA
70    70                   3     70          3.80  pjflex  small   NA       NA
71    71                   4     71          4.80   ayira medium   NA       NA
72    72                   2     72          2.80      pj  small   NA       NA
73    73                   3     73          3.90  pjflex  small   NA       NA
74    74                   4     74          4.90   ayira medium   NA       NA
75    75                   5     75          5.90      pj medium   NA       NA
76    76                   7     76          7.90   ayira    big   NA       NA
77    77                   9     77          9.90  pjflex    big   NA       NA
78    78                   1     78          1.90   ayira  small   NA       NA
79    79                   6     79          6.90  pjflex medium   NA       NA
80    80                   2     80          2.90      pj  small   NA       NA
81    81                   8     81          8.90      pj    big   NA       NA
82    82                   3     82          3.10  pjflex  small   NA       NA
83    83                   4     83          4.10   ayira medium   NA       NA
84    84                   8     84          8.10      pj    big   NA       NA
85    85                   1     85          1.10   ayira  small   NA       NA
86    86                   2     86          2.10      pj  small   NA       NA
87    87                   9     87          9.10  pjflex    big   NA       NA
88    88                   5     88          5.10      pj medium   NA       NA
89    89                   7     89          7.10   ayira    big   NA       NA
90    90                   6     90          6.10  pjflex medium   NA       NA
91    91                   6     91          6.11  pjflex medium   NA       NA
92    92                   4     92          4.11   ayira medium   NA       NA
93    93                   5     93          5.11      pj medium   NA       NA
94    94                   7     94          7.11   ayira    big   NA       NA
95    95                   9     95          9.11  pjflex    big   NA       NA
96    96                   3     96          3.11  pjflex  small   NA       NA
97    97                   8     97          8.11      pj    big   NA       NA
98    98                   1     98          1.11   ayira  small   NA       NA
99    99                   2     99          2.11      pj  small   NA       NA
100  100                   3    100          3.12  pjflex  small   NA       NA
101  101                   4    101          4.12   ayira medium   NA       NA
102  102                   7    102          7.12   ayira    big   NA       NA
103  103                   2    103          2.12      pj  small   NA       NA
104  104                   5    104          5.12      pj medium   NA       NA
105  105                   6    105          6.12  pjflex medium   NA       NA
106  106                   1    106          1.12   ayira  small   NA       NA
107  107                   8    107          8.12      pj    big   NA       NA
108  108                   9    108          9.12  pjflex    big   NA       NA
109  109                   3    109          3.13  pjflex  small   NA       NA
110  110                   2    110          2.13      pj  small   NA       NA
111  111                   1    111          1.13   ayira  small   NA       NA
112  112                   7    112          7.13   ayira    big   NA       NA
113  113                   9    113          9.13  pjflex    big   NA       NA
114  114                   8    114          8.13      pj    big   NA       NA
115  115                   5    115          5.13      pj medium   NA       NA
116  116                   6    116          6.13  pjflex medium   NA       NA
117  117                   4    117          4.13   ayira medium   NA       NA
118  118                   4    118          4.14   ayira medium   NA       NA
119  119                   2    119          2.14      pj  small   NA       NA
120  120                   1    120          1.14   ayira  small   NA       NA
121  121                   5    121          5.14      pj medium   NA       NA
122  122                   6    122          6.14  pjflex medium   NA       NA
123  123                   8    123          8.14      pj    big   NA       NA
124  124                   7    124          7.14   ayira    big   NA       NA
125  125                   3    125          3.14  pjflex  small   NA       NA
126  126                   9    126          9.14  pjflex    big   NA       NA
127  127                   5    127          5.15      pj medium   NA       NA
128  128                   6    128          6.15  pjflex medium   NA       NA
129  129                   2    129          2.15      pj  small   NA       NA
130  130                   1    130          1.15   ayira  small   NA       NA
131  131                   8    131          8.15      pj    big   NA       NA
132  132                   3    132          3.15  pjflex  small   NA       NA
133  133                   7    133          7.15   ayira    big   NA       NA
134  134                   9    134          9.15  pjflex    big   NA       NA
135  135                   4    135          4.15   ayira medium   NA       NA
136  136                   7    136          7.16   ayira    big   NA       NA
137  137                   4    137          4.16   ayira medium   NA       NA
138  138                   8    138          8.16      pj    big   NA       NA
139  139                   2    139          2.16      pj  small   NA       NA
140  140                   3    140          3.16  pjflex  small   NA       NA
141  141                   1    141          1.16   ayira  small   NA       NA
142  142                   5    142          5.16      pj medium   NA       NA
143  143                   9    143          9.16  pjflex    big   NA       NA
144  144                   6    144          6.16  pjflex medium   NA       NA
145  145                   2    145          2.17      pj  small   NA       NA
146  146                   4    146          4.17   ayira medium   NA       NA
147  147                   9    147          9.17  pjflex    big   NA       NA
148  148                   1    148          1.17   ayira  small   NA       NA
149  149                   8    149          8.17      pj    big   NA       NA
150  150                   5    150          5.17      pj medium   NA       NA
151  151                   6    151          6.17  pjflex medium   NA       NA
152  152                   7    152          7.17   ayira    big   NA       NA
153  153                   3    153          3.17  pjflex  small   NA       NA
154  154                   5    154          5.18      pj medium   NA       NA
155  155                   8    155          8.18      pj    big   NA       NA
156  156                   9    156          9.18  pjflex    big   NA       NA
157  157                   2    157          2.18      pj  small   NA       NA
158  158                   3    158          3.18  pjflex  small   NA       NA
159  159                   6    159          6.18  pjflex medium   NA       NA
160  160                   7    160          7.18   ayira    big   NA       NA
161  161                   4    161          4.18   ayira medium   NA       NA
162  162                   1    162          1.18   ayira  small   NA       NA
163  163                   7    163          7.19   ayira    big   NA       NA
164  164                   3    164          3.19  pjflex  small   NA       NA
165  165                   2    165          2.19      pj  small   NA       NA
166  166                   6    166          6.19  pjflex medium   NA       NA
167  167                   5    167          5.19      pj medium   NA       NA
168  168                   9    168          9.19  pjflex    big   NA       NA
169  169                   4    169          4.19   ayira medium   NA       NA
170  170                   8    170          8.19      pj    big   NA       NA
171  171                   1    171          1.19   ayira  small   NA       NA
172  172                   3    172          3.20  pjflex  small   NA       NA
173  173                   7    173          7.20   ayira    big   NA       NA
174  174                   2    174          2.20      pj  small   NA       NA
175  175                   1    175          1.20   ayira  small   NA       NA
176  176                   6    176          6.20  pjflex medium   NA       NA
177  177                   9    177          9.20  pjflex    big   NA       NA
178  178                   5    178          5.20      pj medium   NA       NA
179  179                   8    179          8.20      pj    big   NA       NA
180  180                   4    180          4.20   ayira medium   NA       NA
181  181                   2    181          2.21      pj  small   NA       NA
182  182                   4    182          4.21   ayira medium   NA       NA
183  183                   9    183          9.21  pjflex    big   NA       NA
184  184                   8    184          8.21      pj    big   NA       NA
185  185                   7    185          7.21   ayira    big   NA       NA
186  186                   1    186          1.21   ayira  small   NA       NA
187  187                   5    187          5.21      pj medium   NA       NA
188  188                   3    188          3.21  pjflex  small   NA       NA
189  189                   6    189          6.21  pjflex medium   NA       NA
190  190                   6    190          6.22  pjflex medium   NA       NA
191  191                   7    191          7.22   ayira    big   NA       NA
192  192                   2    192          2.22      pj  small   NA       NA
193  193                   4    193          4.22   ayira medium   NA       NA
194  194                   9    194          9.22  pjflex    big   NA       NA
195  195                   1    195          1.22   ayira  small   NA       NA
196  196                   8    196          8.22      pj    big   NA       NA
197  197                   3    197          3.22  pjflex  small   NA       NA
198  198                   5    198          5.22      pj medium   NA       NA
199  199                   5    199          5.23      pj medium   NA       NA
200  200                   3    200          3.23  pjflex  small   NA       NA
201  201                   6    201          6.23  pjflex medium   NA       NA
202  202                   8    202          8.23      pj    big   NA       NA
203  203                   2    203          2.23      pj  small   NA       NA
204  204                   7    204          7.23   ayira    big   NA       NA
205  205                   1    205          1.23   ayira  small   NA       NA
206  206                   9    206          9.23  pjflex    big   NA       NA
207  207                   4    207          4.23   ayira medium   NA       NA
208  208                   3    208          3.24  pjflex  small   NA       NA
209  209                   8    209          8.24      pj    big   NA       NA
210  210                   6    210          6.24  pjflex medium   NA       NA
211  211                   2    211          2.24      pj  small   NA       NA
212  212                   9    212          9.24  pjflex    big   NA       NA
213  213                   7    213          7.24   ayira    big   NA       NA
214  214                   5    214          5.24      pj medium   NA       NA
215  215                   4    215          4.24   ayira medium   NA       NA
216  216                   1    216          1.24   ayira  small   NA       NA
217  217                   7    217          7.25   ayira    big   NA       NA
218  218                   9    218          9.25  pjflex    big   NA       NA
219  219                   1    219          1.25   ayira  small   NA       NA
220  220                   4    220          4.25   ayira medium   NA       NA
221  221                   8    221          8.25      pj    big   NA       NA
222  222                   5    222          5.25      pj medium   NA       NA
223  223                   6    223          6.25  pjflex medium   NA       NA
224  224                   3    224          3.25  pjflex  small   NA       NA
225  225                   2    225          2.25      pj  small   NA       NA
226  226                   6    226          6.26  pjflex medium   NA       NA
227  227                   5    227          5.26      pj medium   NA       NA
228  228                   2    228          2.26      pj  small   NA       NA
229  229                   1    229          1.26   ayira  small   NA       NA
230  230                   7    230          7.26   ayira    big   NA       NA
231  231                   4    231          4.26   ayira medium   NA       NA
232  232                   9    232          9.26  pjflex    big   NA       NA
233  233                   8    233          8.26      pj    big   NA       NA
234  234                   3    234          3.26  pjflex  small   NA       NA
235  235                   8    235          8.27      pj    big   NA       NA
236  236                   9    236          9.27  pjflex    big   NA       NA
237  237                   1    237          1.27   ayira  small   NA       NA
238  238                   5    238          5.27      pj medium   NA       NA
239  239                   7    239          7.27   ayira    big   NA       NA
240  240                   6    240          6.27  pjflex medium   NA       NA
241  241                   2    241          2.27      pj  small   NA       NA
242  242                   4    242          4.27   ayira medium   NA       NA
243  243                   3    243          3.27  pjflex  small   NA       NA
244  244                   3    244          3.28  pjflex  small   NA       NA
245  245                   8    245          8.28      pj    big   NA       NA
246  246                   2    246          2.28      pj  small   NA       NA
247  247                   1    247          1.28   ayira  small   NA       NA
248  248                   7    248          7.28   ayira    big   NA       NA
249  249                   5    249          5.28      pj medium   NA       NA
250  250                   9    250          9.28  pjflex    big   NA       NA
251  251                   6    251          6.28  pjflex medium   NA       NA
252  252                   4    252          4.28   ayira medium   NA       NA
253  253                   1    253          1.29   ayira  small   NA       NA
254  254                   3    254          3.29  pjflex  small   NA       NA
255  255                   7    255          7.29   ayira    big   NA       NA
256  256                   4    256          4.29   ayira medium   NA       NA
257  257                   6    257          6.29  pjflex medium   NA       NA
258  258                   5    258          5.29      pj medium   NA       NA
259  259                   2    259          2.29      pj  small   NA       NA
260  260                   8    260          8.29      pj    big   NA       NA
261  261                   9    261          9.29  pjflex    big   NA       NA
262  262                   1    262          1.30   ayira  small   NA       NA
263  263                   7    263          7.30   ayira    big   NA       NA
264  264                   3    264          3.30  pjflex  small   NA       NA
265  265                   6    265          6.30  pjflex medium   NA       NA
266  266                   4    266          4.30   ayira medium   NA       NA
267  267                   5    267          5.30      pj medium   NA       NA
268  268                   2    268          2.30      pj  small   NA       NA
269  269                   8    269          8.30      pj    big   NA       NA
270  270                   9    270          9.30  pjflex    big   NA       NA
#+end_example

=NA= means not available. Last two columns should have simulation time
for that factor combination and the platform where experiments took
place.
* 2016-03-29 DoE for Batch Size Investigation                         :Lucas:

The batch size investigation will have two factors: _input_, and
_batch_. The first one with three levels, the second one with six
levels. The levels for input are small (128K), medium (131072K, or
128M), and big (1048576K or 1G). The levels for batch are A, B, C, D,
E and F. Each letter is a integer number which represents the number
of SQL operations in each batch. Based on preliminary runs, Tais will
decide which values to use instead of letters A to F. I'll use them so
it's easy to map them to values once they are defined. We shall again
use 30 replications randomizing experiments to reduce external
interference. Four things are measured: the global simulation time
(all time except DB insertions), the global insertion time (the sum of
the time spent executing all DB insertions - the batches), the maximum
memory occupation during the experiment, and the platform.  Platform
can be one of _luiza_, _guarani_, _orion_, _hptais_ (TODO: rename this last
one). The memory occupation should be measure with exception care,
since the _maximum_ may not appear at the end of the execution,
specially if batches are small.

#+begin_src R :results output silent :session :exports none
  require(DoE.base);
  Batch_Size_Investigation <- fac.design (
           nfactors=2,
           replications=30,
           repeat.only=FALSE,
           blocks=1,
           randomize=TRUE,
           seed=10373,
           nlevels=c(3,6),
           factor.names=list(
                input=c("small", "medium", "big"),
                batch=c("A", "B", "C", "D", "E", "F")));

  export.design(Batch_Size_Investigation,
                path="designs",
                filename=NULL,
                type="csv",
                replace=TRUE,
                response.names=c("sim_time","insert_time","max_mem","platform"));
#+end_src


#+begin_src R :results output :session :exports both
csv <- read.csv("designs/Batch_Size_Investigation.csv");
csv;
#+end_src

#+RESULTS:
#+begin_example
    name run.no.in.std.order run.no run.no.std.rp  input batch sim_time
1      1                   8      1          8.10 medium     C       NA
2      2                  18      2         18.10    big     F       NA
3      3                   5      3          5.10 medium     B       NA
4      4                  12      4         12.10    big     D       NA
5      5                  16      5         16.10  small     F       NA
6      6                   6      6          6.10    big     B       NA
7      7                  15      7         15.10    big     E       NA
8      8                   3      8          3.10    big     A       NA
9      9                  13      9         13.10  small     E       NA
10    10                  10     10         10.10  small     D       NA
11    11                   7     11          7.10  small     C       NA
12    12                  17     12         17.10 medium     F       NA
13    13                   4     13          4.10  small     B       NA
14    14                  11     14         11.10 medium     D       NA
15    15                  14     15         14.10 medium     E       NA
16    16                   2     16          2.10 medium     A       NA
17    17                   9     17          9.10    big     C       NA
18    18                   1     18          1.10  small     A       NA
19    19                   3     19          3.20    big     A       NA
20    20                   5     20          5.20 medium     B       NA
21    21                  14     21         14.20 medium     E       NA
22    22                   1     22          1.20  small     A       NA
23    23                   6     23          6.20    big     B       NA
24    24                  10     24         10.20  small     D       NA
25    25                  13     25         13.20  small     E       NA
26    26                  17     26         17.20 medium     F       NA
27    27                  12     27         12.20    big     D       NA
28    28                  16     28         16.20  small     F       NA
29    29                   7     29          7.20  small     C       NA
30    30                  11     30         11.20 medium     D       NA
31    31                   8     31          8.20 medium     C       NA
32    32                  15     32         15.20    big     E       NA
33    33                   4     33          4.20  small     B       NA
34    34                   9     34          9.20    big     C       NA
35    35                  18     35         18.20    big     F       NA
36    36                   2     36          2.20 medium     A       NA
37    37                   3     37          3.30    big     A       NA
38    38                  11     38         11.30 medium     D       NA
39    39                   5     39          5.30 medium     B       NA
40    40                   6     40          6.30    big     B       NA
41    41                   7     41          7.30  small     C       NA
42    42                  17     42         17.30 medium     F       NA
43    43                  12     43         12.30    big     D       NA
44    44                  10     44         10.30  small     D       NA
45    45                  14     45         14.30 medium     E       NA
46    46                   4     46          4.30  small     B       NA
47    47                  16     47         16.30  small     F       NA
48    48                   2     48          2.30 medium     A       NA
49    49                   9     49          9.30    big     C       NA
50    50                  18     50         18.30    big     F       NA
51    51                  13     51         13.30  small     E       NA
52    52                   8     52          8.30 medium     C       NA
53    53                  15     53         15.30    big     E       NA
54    54                   1     54          1.30  small     A       NA
55    55                  14     55         14.40 medium     E       NA
56    56                   1     56          1.40  small     A       NA
57    57                   5     57          5.40 medium     B       NA
58    58                  12     58         12.40    big     D       NA
59    59                  15     59         15.40    big     E       NA
60    60                   2     60          2.40 medium     A       NA
61    61                  16     61         16.40  small     F       NA
62    62                  13     62         13.40  small     E       NA
63    63                   9     63          9.40    big     C       NA
64    64                   8     64          8.40 medium     C       NA
65    65                   7     65          7.40  small     C       NA
66    66                  18     66         18.40    big     F       NA
67    67                   6     67          6.40    big     B       NA
68    68                  10     68         10.40  small     D       NA
69    69                  17     69         17.40 medium     F       NA
70    70                   3     70          3.40    big     A       NA
71    71                   4     71          4.40  small     B       NA
72    72                  11     72         11.40 medium     D       NA
73    73                   6     73          6.50    big     B       NA
74    74                   9     74          9.50    big     C       NA
75    75                  10     75         10.50  small     D       NA
76    76                  13     76         13.50  small     E       NA
77    77                   8     77          8.50 medium     C       NA
78    78                   2     78          2.50 medium     A       NA
79    79                  17     79         17.50 medium     F       NA
80    80                  18     80         18.50    big     F       NA
81    81                   7     81          7.50  small     C       NA
82    82                   3     82          3.50    big     A       NA
83    83                   4     83          4.50  small     B       NA
84    84                  14     84         14.50 medium     E       NA
85    85                   1     85          1.50  small     A       NA
86    86                  15     86         15.50    big     E       NA
87    87                  12     87         12.50    big     D       NA
88    88                   5     88          5.50 medium     B       NA
89    89                  16     89         16.50  small     F       NA
90    90                  11     90         11.50 medium     D       NA
91    91                  12     91         12.60    big     D       NA
92    92                   8     92          8.60 medium     C       NA
93    93                  18     93         18.60    big     F       NA
94    94                  11     94         11.60 medium     D       NA
95    95                  16     95         16.60  small     F       NA
96    96                  17     96         17.60 medium     F       NA
97    97                   9     97          9.60    big     C       NA
98    98                   5     98          5.60 medium     B       NA
99    99                  13     99         13.60  small     E       NA
100  100                   3    100          3.60    big     A       NA
101  101                   4    101          4.60  small     B       NA
102  102                   7    102          7.60  small     C       NA
103  103                   2    103          2.60 medium     A       NA
104  104                  15    104         15.60    big     E       NA
105  105                   6    105          6.60    big     B       NA
106  106                   1    106          1.60  small     A       NA
107  107                  10    107         10.60  small     D       NA
108  108                  14    108         14.60 medium     E       NA
109  109                   6    109          6.70    big     B       NA
110  110                   4    110          4.70  small     B       NA
111  111                   1    111          1.70  small     A       NA
112  112                   2    112          2.70 medium     A       NA
113  113                   7    113          7.70  small     C       NA
114  114                  18    114         18.70    big     F       NA
115  115                  10    115         10.70  small     D       NA
116  116                   5    116          5.70 medium     B       NA
117  117                  16    117         16.70  small     F       NA
118  118                  17    118         17.70 medium     F       NA
119  119                  15    119         15.70    big     E       NA
120  120                  12    120         12.70    big     D       NA
121  121                  11    121         11.70 medium     D       NA
122  122                  13    122         13.70  small     E       NA
123  123                   8    123          8.70 medium     C       NA
124  124                  14    124         14.70 medium     E       NA
125  125                   3    125          3.70    big     A       NA
126  126                   9    126          9.70    big     C       NA
127  127                  10    127         10.80  small     D       NA
128  128                  11    128         11.80 medium     D       NA
129  129                   5    129          5.80 medium     B       NA
130  130                   1    130          1.80  small     A       NA
131  131                   2    131          2.80 medium     A       NA
132  132                   9    132          9.80    big     C       NA
133  133                   7    133          7.80  small     C       NA
134  134                  14    134         14.80 medium     E       NA
135  135                  13    135         13.80  small     E       NA
136  136                  12    136         12.80    big     D       NA
137  137                   4    137          4.80  small     B       NA
138  138                   8    138          8.80 medium     C       NA
139  139                  17    139         17.80 medium     F       NA
140  140                   3    140          3.80    big     A       NA
141  141                  15    141         15.80    big     E       NA
142  142                  16    142         16.80  small     F       NA
143  143                  18    143         18.80    big     F       NA
144  144                   6    144          6.80    big     B       NA
145  145                   4    145          4.90  small     B       NA
146  146                   8    146          8.90 medium     C       NA
147  147                  18    147         18.90    big     F       NA
148  148                   2    148          2.90 medium     A       NA
149  149                  11    149         11.90 medium     D       NA
150  150                  12    150         12.90    big     D       NA
151  151                   3    151          3.90    big     A       NA
152  152                  10    152         10.90  small     D       NA
153  153                  14    153         14.90 medium     E       NA
154  154                   5    154          5.90 medium     B       NA
155  155                  17    155         17.90 medium     F       NA
156  156                   9    156          9.90    big     C       NA
157  157                  15    157         15.90    big     E       NA
158  158                  13    158         13.90  small     E       NA
159  159                   6    159          6.90    big     B       NA
160  160                   7    160          7.90  small     C       NA
161  161                  16    161         16.90  small     F       NA
162  162                   1    162          1.90  small     A       NA
163  163                  13    163         13.10  small     E       NA
164  164                   5    164          5.10 medium     B       NA
165  165                   3    165          3.10    big     A       NA
166  166                  15    166         15.10    big     E       NA
167  167                  14    167         14.10 medium     E       NA
168  168                  17    168         17.10 medium     F       NA
169  169                   6    169          6.10    big     B       NA
170  170                   7    170          7.10  small     C       NA
171  171                  12    171         12.10    big     D       NA
172  172                  16    172         16.10  small     F       NA
173  173                  11    173         11.10 medium     D       NA
174  174                   2    174          2.10 medium     A       NA
175  175                   1    175          1.10  small     A       NA
176  176                  10    176         10.10  small     D       NA
177  177                   9    177          9.10    big     C       NA
178  178                  18    178         18.10    big     F       NA
179  179                   8    179          8.10 medium     C       NA
180  180                   4    180          4.10  small     B       NA
181  181                   3    181          3.11    big     A       NA
182  182                   7    182          7.11  small     C       NA
183  183                   4    183          4.11  small     B       NA
184  184                   8    184          8.11 medium     C       NA
185  185                   5    185          5.11 medium     B       NA
186  186                   1    186          1.11  small     A       NA
187  187                  17    187         17.11 medium     F       NA
188  188                   9    188          9.11    big     C       NA
189  189                   2    189          2.11 medium     A       NA
190  190                   6    190          6.11    big     B       NA
191  191                  12    191         12.11    big     D       NA
192  192                  10    192         10.11  small     D       NA
193  193                  16    193         16.11  small     F       NA
194  194                  11    194         11.11 medium     D       NA
195  195                  13    195         13.11  small     E       NA
196  196                  15    196         15.11    big     E       NA
197  197                  18    197         18.11    big     F       NA
198  198                  14    198         14.11 medium     E       NA
199  199                  10    199         10.12  small     D       NA
200  200                   5    200          5.12 medium     B       NA
201  201                  13    201         13.12  small     E       NA
202  202                   7    202          7.12  small     C       NA
203  203                   4    203          4.12  small     B       NA
204  204                   8    204          8.12 medium     C       NA
205  205                   3    205          3.12    big     A       NA
206  206                  11    206         11.12 medium     D       NA
207  207                  14    207         14.12 medium     E       NA
208  208                  12    208         12.12    big     D       NA
209  209                  16    209         16.12  small     F       NA
210  210                   6    210          6.12    big     B       NA
211  211                   2    211          2.12 medium     A       NA
212  212                   9    212          9.12    big     C       NA
213  213                  15    213         15.12    big     E       NA
214  214                  17    214         17.12 medium     F       NA
215  215                  18    215         18.12    big     F       NA
216  216                   1    216          1.12  small     A       NA
217  217                  13    217         13.13  small     E       NA
218  218                  14    218         14.13 medium     E       NA
219  219                   1    219          1.13  small     A       NA
220  220                  10    220         10.13  small     D       NA
221  221                   2    221          2.13 medium     A       NA
222  222                  17    222         17.13 medium     F       NA
223  223                  16    223         16.13  small     F       NA
224  224                   4    224          4.13  small     B       NA
225  225                   7    225          7.13  small     C       NA
226  226                   6    226          6.13    big     B       NA
227  227                   5    227          5.13 medium     B       NA
228  228                  18    228         18.13    big     F       NA
229  229                  12    229         12.13    big     D       NA
230  230                  15    230         15.13    big     E       NA
231  231                  11    231         11.13 medium     D       NA
232  232                   9    232          9.13    big     C       NA
233  233                   8    233          8.13 medium     C       NA
234  234                   3    234          3.13    big     A       NA
235  235                  15    235         15.14    big     E       NA
236  236                  18    236         18.14    big     F       NA
237  237                   1    237          1.14  small     A       NA
238  238                  12    238         12.14    big     D       NA
239  239                   3    239          3.14    big     A       NA
240  240                  14    240         14.14 medium     E       NA
241  241                   7    241          7.14  small     C       NA
242  242                  16    242         16.14  small     F       NA
243  243                  17    243         17.14 medium     F       NA
244  244                  13    244         13.14  small     E       NA
245  245                   8    245          8.14 medium     C       NA
246  246                   2    246          2.14 medium     A       NA
247  247                  11    247         11.14 medium     D       NA
248  248                  10    248         10.14  small     D       NA
249  249                   5    249          5.14 medium     B       NA
250  250                   9    250          9.14    big     C       NA
251  251                   6    251          6.14    big     B       NA
252  252                   4    252          4.14  small     B       NA
253  253                   2    253          2.15 medium     A       NA
254  254                   6    254          6.15    big     B       NA
255  255                  16    255         16.15  small     F       NA
256  256                   9    256          9.15    big     C       NA
257  257                  11    257         11.15 medium     D       NA
258  258                  13    258         13.15  small     E       NA
259  259                   7    259          7.15  small     C       NA
260  260                  15    260         15.15    big     E       NA
261  261                   1    261          1.15  small     A       NA
262  262                  10    262         10.15  small     D       NA
263  263                  12    263         12.15    big     D       NA
264  264                   3    264          3.15    big     A       NA
265  265                  17    265         17.15 medium     F       NA
266  266                   4    266          4.15  small     B       NA
267  267                   5    267          5.15 medium     B       NA
268  268                  18    268         18.15    big     F       NA
269  269                   8    269          8.15 medium     C       NA
270  270                  14    270         14.15 medium     E       NA
271  271                   3    271          3.16    big     A       NA
272  272                  14    272         14.16 medium     E       NA
273  273                   1    273          1.16  small     A       NA
274  274                  11    274         11.16 medium     D       NA
275  275                   7    275          7.16  small     C       NA
276  276                   6    276          6.16    big     B       NA
277  277                   5    277          5.16 medium     B       NA
278  278                  15    278         15.16    big     E       NA
279  279                  18    279         18.16    big     F       NA
280  280                  13    280         13.16  small     E       NA
281  281                  12    281         12.16    big     D       NA
282  282                   2    282          2.16 medium     A       NA
283  283                  10    283         10.16  small     D       NA
284  284                  17    284         17.16 medium     F       NA
285  285                   4    285          4.16  small     B       NA
286  286                  16    286         16.16  small     F       NA
287  287                   8    287          8.16 medium     C       NA
288  288                   9    288          9.16    big     C       NA
289  289                  12    289         12.17    big     D       NA
290  290                  15    290         15.17    big     E       NA
291  291                  16    291         16.17  small     F       NA
292  292                  17    292         17.17 medium     F       NA
293  293                   4    293          4.17  small     B       NA
294  294                   3    294          3.17    big     A       NA
295  295                  10    295         10.17  small     D       NA
296  296                   8    296          8.17 medium     C       NA
297  297                   6    297          6.17    big     B       NA
298  298                   9    298          9.17    big     C       NA
299  299                   5    299          5.17 medium     B       NA
300  300                   1    300          1.17  small     A       NA
301  301                  13    301         13.17  small     E       NA
302  302                  14    302         14.17 medium     E       NA
303  303                  18    303         18.17    big     F       NA
304  304                  11    304         11.17 medium     D       NA
305  305                   2    305          2.17 medium     A       NA
306  306                   7    306          7.17  small     C       NA
307  307                   2    307          2.18 medium     A       NA
308  308                  10    308         10.18  small     D       NA
309  309                  11    309         11.18 medium     D       NA
310  310                  15    310         15.18    big     E       NA
311  311                   8    311          8.18 medium     C       NA
312  312                   3    312          3.18    big     A       NA
313  313                   7    313          7.18  small     C       NA
314  314                  18    314         18.18    big     F       NA
315  315                  14    315         14.18 medium     E       NA
316  316                   9    316          9.18    big     C       NA
317  317                   1    317          1.18  small     A       NA
318  318                  13    318         13.18  small     E       NA
319  319                   6    319          6.18    big     B       NA
320  320                  16    320         16.18  small     F       NA
321  321                   4    321          4.18  small     B       NA
322  322                  17    322         17.18 medium     F       NA
323  323                   5    323          5.18 medium     B       NA
324  324                  12    324         12.18    big     D       NA
325  325                   8    325          8.19 medium     C       NA
326  326                  18    326         18.19    big     F       NA
327  327                   4    327          4.19  small     B       NA
328  328                   1    328          1.19  small     A       NA
329  329                   2    329          2.19 medium     A       NA
330  330                  11    330         11.19 medium     D       NA
331  331                  13    331         13.19  small     E       NA
332  332                  15    332         15.19    big     E       NA
333  333                  12    333         12.19    big     D       NA
334  334                  10    334         10.19  small     D       NA
335  335                   3    335          3.19    big     A       NA
336  336                  17    336         17.19 medium     F       NA
337  337                   7    337          7.19  small     C       NA
338  338                   6    338          6.19    big     B       NA
339  339                   9    339          9.19    big     C       NA
340  340                  16    340         16.19  small     F       NA
341  341                  14    341         14.19 medium     E       NA
342  342                   5    342          5.19 medium     B       NA
343  343                   5    343          5.20 medium     B       NA
344  344                  15    344         15.20    big     E       NA
345  345                   4    345          4.20  small     B       NA
346  346                  13    346         13.20  small     E       NA
347  347                  10    347         10.20  small     D       NA
348  348                   9    348          9.20    big     C       NA
349  349                   6    349          6.20    big     B       NA
350  350                   3    350          3.20    big     A       NA
351  351                  12    351         12.20    big     D       NA
352  352                   8    352          8.20 medium     C       NA
353  353                  16    353         16.20  small     F       NA
354  354                   1    354          1.20  small     A       NA
355  355                   2    355          2.20 medium     A       NA
356  356                  11    356         11.20 medium     D       NA
357  357                  17    357         17.20 medium     F       NA
358  358                  18    358         18.20    big     F       NA
359  359                  14    359         14.20 medium     E       NA
360  360                   7    360          7.20  small     C       NA
361  361                  12    361         12.21    big     D       NA
362  362                  11    362         11.21 medium     D       NA
363  363                  17    363         17.21 medium     F       NA
364  364                  16    364         16.21  small     F       NA
365  365                   9    365          9.21    big     C       NA
366  366                   4    366          4.21  small     B       NA
367  367                   7    367          7.21  small     C       NA
368  368                  15    368         15.21    big     E       NA
369  369                   2    369          2.21 medium     A       NA
370  370                   3    370          3.21    big     A       NA
371  371                   8    371          8.21 medium     C       NA
372  372                  10    372         10.21  small     D       NA
373  373                   5    373          5.21 medium     B       NA
374  374                  18    374         18.21    big     F       NA
375  375                  13    375         13.21  small     E       NA
376  376                  14    376         14.21 medium     E       NA
377  377                   6    377          6.21    big     B       NA
378  378                   1    378          1.21  small     A       NA
379  379                   5    379          5.22 medium     B       NA
380  380                   4    380          4.22  small     B       NA
381  381                  18    381         18.22    big     F       NA
382  382                   2    382          2.22 medium     A       NA
383  383                  12    383         12.22    big     D       NA
384  384                   9    384          9.22    big     C       NA
385  385                   7    385          7.22  small     C       NA
386  386                  16    386         16.22  small     F       NA
387  387                  14    387         14.22 medium     E       NA
388  388                  17    388         17.22 medium     F       NA
389  389                  15    389         15.22    big     E       NA
390  390                  10    390         10.22  small     D       NA
391  391                   6    391          6.22    big     B       NA
392  392                   3    392          3.22    big     A       NA
393  393                   8    393          8.22 medium     C       NA
394  394                   1    394          1.22  small     A       NA
395  395                  11    395         11.22 medium     D       NA
396  396                  13    396         13.22  small     E       NA
397  397                  14    397         14.23 medium     E       NA
398  398                   3    398          3.23    big     A       NA
399  399                   8    399          8.23 medium     C       NA
400  400                   1    400          1.23  small     A       NA
401  401                   4    401          4.23  small     B       NA
402  402                  12    402         12.23    big     D       NA
403  403                  16    403         16.23  small     F       NA
404  404                   7    404          7.23  small     C       NA
405  405                   6    405          6.23    big     B       NA
406  406                   9    406          9.23    big     C       NA
407  407                  18    407         18.23    big     F       NA
408  408                   5    408          5.23 medium     B       NA
409  409                  15    409         15.23    big     E       NA
410  410                   2    410          2.23 medium     A       NA
411  411                  13    411         13.23  small     E       NA
412  412                  17    412         17.23 medium     F       NA
413  413                  11    413         11.23 medium     D       NA
414  414                  10    414         10.23  small     D       NA
415  415                   3    415          3.24    big     A       NA
416  416                  14    416         14.24 medium     E       NA
417  417                  16    417         16.24  small     F       NA
418  418                  17    418         17.24 medium     F       NA
419  419                   8    419          8.24 medium     C       NA
420  420                  18    420         18.24    big     F       NA
421  421                   5    421          5.24 medium     B       NA
422  422                   6    422          6.24    big     B       NA
423  423                   9    423          9.24    big     C       NA
424  424                   2    424          2.24 medium     A       NA
425  425                   4    425          4.24  small     B       NA
426  426                  15    426         15.24    big     E       NA
427  427                   1    427          1.24  small     A       NA
428  428                   7    428          7.24  small     C       NA
429  429                  13    429         13.24  small     E       NA
430  430                  12    430         12.24    big     D       NA
431  431                  10    431         10.24  small     D       NA
432  432                  11    432         11.24 medium     D       NA
433  433                  13    433         13.25  small     E       NA
434  434                   4    434          4.25  small     B       NA
435  435                   3    435          3.25    big     A       NA
436  436                   9    436          9.25    big     C       NA
437  437                  11    437         11.25 medium     D       NA
438  438                   8    438          8.25 medium     C       NA
439  439                   7    439          7.25  small     C       NA
440  440                   1    440          1.25  small     A       NA
441  441                  14    441         14.25 medium     E       NA
442  442                  15    442         15.25    big     E       NA
443  443                  16    443         16.25  small     F       NA
444  444                  17    444         17.25 medium     F       NA
445  445                   6    445          6.25    big     B       NA
446  446                  10    446         10.25  small     D       NA
447  447                  18    447         18.25    big     F       NA
448  448                  12    448         12.25    big     D       NA
449  449                   5    449          5.25 medium     B       NA
450  450                   2    450          2.25 medium     A       NA
451  451                   7    451          7.26  small     C       NA
452  452                  11    452         11.26 medium     D       NA
453  453                   6    453          6.26    big     B       NA
454  454                  15    454         15.26    big     E       NA
455  455                   8    455          8.26 medium     C       NA
456  456                   4    456          4.26  small     B       NA
457  457                  14    457         14.26 medium     E       NA
458  458                  16    458         16.26  small     F       NA
459  459                   1    459          1.26  small     A       NA
460  460                  10    460         10.26  small     D       NA
461  461                  18    461         18.26    big     F       NA
462  462                   5    462          5.26 medium     B       NA
463  463                   2    463          2.26 medium     A       NA
464  464                  12    464         12.26    big     D       NA
465  465                   9    465          9.26    big     C       NA
466  466                  13    466         13.26  small     E       NA
467  467                   3    467          3.26    big     A       NA
468  468                  17    468         17.26 medium     F       NA
469  469                  15    469         15.27    big     E       NA
470  470                   6    470          6.27    big     B       NA
471  471                   4    471          4.27  small     B       NA
472  472                   9    472          9.27    big     C       NA
473  473                  14    473         14.27 medium     E       NA
474  474                  10    474         10.27  small     D       NA
475  475                   3    475          3.27    big     A       NA
476  476                  18    476         18.27    big     F       NA
477  477                  17    477         17.27 medium     F       NA
478  478                   2    478          2.27 medium     A       NA
479  479                   7    479          7.27  small     C       NA
480  480                   5    480          5.27 medium     B       NA
481  481                  11    481         11.27 medium     D       NA
482  482                  12    482         12.27    big     D       NA
483  483                   8    483          8.27 medium     C       NA
484  484                   1    484          1.27  small     A       NA
485  485                  13    485         13.27  small     E       NA
486  486                  16    486         16.27  small     F       NA
487  487                   2    487          2.28 medium     A       NA
488  488                   7    488          7.28  small     C       NA
489  489                  10    489         10.28  small     D       NA
490  490                   8    490          8.28 medium     C       NA
491  491                   9    491          9.28    big     C       NA
492  492                  11    492         11.28 medium     D       NA
493  493                   3    493          3.28    big     A       NA
494  494                  12    494         12.28    big     D       NA
495  495                   5    495          5.28 medium     B       NA
496  496                   4    496          4.28  small     B       NA
497  497                  16    497         16.28  small     F       NA
498  498                  14    498         14.28 medium     E       NA
499  499                  13    499         13.28  small     E       NA
500  500                   1    500          1.28  small     A       NA
501  501                  18    501         18.28    big     F       NA
502  502                  15    502         15.28    big     E       NA
503  503                  17    503         17.28 medium     F       NA
504  504                   6    504          6.28    big     B       NA
505  505                  16    505         16.29  small     F       NA
506  506                  15    506         15.29    big     E       NA
507  507                  12    507         12.29    big     D       NA
508  508                   8    508          8.29 medium     C       NA
509  509                   7    509          7.29  small     C       NA
510  510                   5    510          5.29 medium     B       NA
511  511                  18    511         18.29    big     F       NA
512  512                   1    512          1.29  small     A       NA
513  513                   3    513          3.29    big     A       NA
514  514                  17    514         17.29 medium     F       NA
515  515                  11    515         11.29 medium     D       NA
516  516                   6    516          6.29    big     B       NA
517  517                   4    517          4.29  small     B       NA
518  518                   2    518          2.29 medium     A       NA
519  519                  10    519         10.29  small     D       NA
520  520                  13    520         13.29  small     E       NA
521  521                  14    521         14.29 medium     E       NA
522  522                   9    522          9.29    big     C       NA
523  523                  13    523         13.30  small     E       NA
524  524                   4    524          4.30  small     B       NA
525  525                   6    525          6.30    big     B       NA
526  526                   5    526          5.30 medium     B       NA
527  527                  18    527         18.30    big     F       NA
528  528                   2    528          2.30 medium     A       NA
529  529                   8    529          8.30 medium     C       NA
530  530                  17    530         17.30 medium     F       NA
531  531                  12    531         12.30    big     D       NA
532  532                   1    532          1.30  small     A       NA
533  533                   3    533          3.30    big     A       NA
534  534                  15    534         15.30    big     E       NA
535  535                  10    535         10.30  small     D       NA
536  536                  14    536         14.30 medium     E       NA
537  537                   9    537          9.30    big     C       NA
538  538                   7    538          7.30  small     C       NA
539  539                  16    539         16.30  small     F       NA
540  540                  11    540         11.30 medium     D       NA
    insert_time max_mem platform
1            NA      NA       NA
2            NA      NA       NA
3            NA      NA       NA
4            NA      NA       NA
5            NA      NA       NA
6            NA      NA       NA
7            NA      NA       NA
8            NA      NA       NA
9            NA      NA       NA
10           NA      NA       NA
11           NA      NA       NA
12           NA      NA       NA
13           NA      NA       NA
14           NA      NA       NA
15           NA      NA       NA
16           NA      NA       NA
17           NA      NA       NA
18           NA      NA       NA
19           NA      NA       NA
20           NA      NA       NA
21           NA      NA       NA
22           NA      NA       NA
23           NA      NA       NA
24           NA      NA       NA
25           NA      NA       NA
26           NA      NA       NA
27           NA      NA       NA
28           NA      NA       NA
29           NA      NA       NA
30           NA      NA       NA
31           NA      NA       NA
32           NA      NA       NA
33           NA      NA       NA
34           NA      NA       NA
35           NA      NA       NA
36           NA      NA       NA
37           NA      NA       NA
38           NA      NA       NA
39           NA      NA       NA
40           NA      NA       NA
41           NA      NA       NA
42           NA      NA       NA
43           NA      NA       NA
44           NA      NA       NA
45           NA      NA       NA
46           NA      NA       NA
47           NA      NA       NA
48           NA      NA       NA
49           NA      NA       NA
50           NA      NA       NA
51           NA      NA       NA
52           NA      NA       NA
53           NA      NA       NA
54           NA      NA       NA
55           NA      NA       NA
56           NA      NA       NA
57           NA      NA       NA
58           NA      NA       NA
59           NA      NA       NA
60           NA      NA       NA
61           NA      NA       NA
62           NA      NA       NA
63           NA      NA       NA
64           NA      NA       NA
65           NA      NA       NA
66           NA      NA       NA
67           NA      NA       NA
68           NA      NA       NA
69           NA      NA       NA
70           NA      NA       NA
71           NA      NA       NA
72           NA      NA       NA
73           NA      NA       NA
74           NA      NA       NA
75           NA      NA       NA
76           NA      NA       NA
77           NA      NA       NA
78           NA      NA       NA
79           NA      NA       NA
80           NA      NA       NA
81           NA      NA       NA
82           NA      NA       NA
83           NA      NA       NA
84           NA      NA       NA
85           NA      NA       NA
86           NA      NA       NA
87           NA      NA       NA
88           NA      NA       NA
89           NA      NA       NA
90           NA      NA       NA
91           NA      NA       NA
92           NA      NA       NA
93           NA      NA       NA
94           NA      NA       NA
95           NA      NA       NA
96           NA      NA       NA
97           NA      NA       NA
98           NA      NA       NA
99           NA      NA       NA
100          NA      NA       NA
101          NA      NA       NA
102          NA      NA       NA
103          NA      NA       NA
104          NA      NA       NA
105          NA      NA       NA
106          NA      NA       NA
107          NA      NA       NA
108          NA      NA       NA
109          NA      NA       NA
110          NA      NA       NA
111          NA      NA       NA
112          NA      NA       NA
113          NA      NA       NA
114          NA      NA       NA
115          NA      NA       NA
116          NA      NA       NA
117          NA      NA       NA
118          NA      NA       NA
119          NA      NA       NA
120          NA      NA       NA
121          NA      NA       NA
122          NA      NA       NA
123          NA      NA       NA
124          NA      NA       NA
125          NA      NA       NA
126          NA      NA       NA
127          NA      NA       NA
128          NA      NA       NA
129          NA      NA       NA
130          NA      NA       NA
131          NA      NA       NA
132          NA      NA       NA
133          NA      NA       NA
134          NA      NA       NA
135          NA      NA       NA
136          NA      NA       NA
137          NA      NA       NA
138          NA      NA       NA
139          NA      NA       NA
140          NA      NA       NA
141          NA      NA       NA
142          NA      NA       NA
143          NA      NA       NA
144          NA      NA       NA
145          NA      NA       NA
146          NA      NA       NA
147          NA      NA       NA
148          NA      NA       NA
149          NA      NA       NA
150          NA      NA       NA
151          NA      NA       NA
152          NA      NA       NA
153          NA      NA       NA
154          NA      NA       NA
155          NA      NA       NA
156          NA      NA       NA
157          NA      NA       NA
158          NA      NA       NA
159          NA      NA       NA
160          NA      NA       NA
161          NA      NA       NA
162          NA      NA       NA
163          NA      NA       NA
164          NA      NA       NA
165          NA      NA       NA
166          NA      NA       NA
167          NA      NA       NA
168          NA      NA       NA
169          NA      NA       NA
170          NA      NA       NA
171          NA      NA       NA
172          NA      NA       NA
173          NA      NA       NA
174          NA      NA       NA
175          NA      NA       NA
176          NA      NA       NA
177          NA      NA       NA
178          NA      NA       NA
179          NA      NA       NA
180          NA      NA       NA
181          NA      NA       NA
182          NA      NA       NA
183          NA      NA       NA
184          NA      NA       NA
185          NA      NA       NA
186          NA      NA       NA
187          NA      NA       NA
188          NA      NA       NA
189          NA      NA       NA
190          NA      NA       NA
191          NA      NA       NA
192          NA      NA       NA
193          NA      NA       NA
194          NA      NA       NA
195          NA      NA       NA
196          NA      NA       NA
197          NA      NA       NA
198          NA      NA       NA
199          NA      NA       NA
200          NA      NA       NA
201          NA      NA       NA
202          NA      NA       NA
203          NA      NA       NA
204          NA      NA       NA
205          NA      NA       NA
206          NA      NA       NA
207          NA      NA       NA
208          NA      NA       NA
209          NA      NA       NA
210          NA      NA       NA
211          NA      NA       NA
212          NA      NA       NA
213          NA      NA       NA
214          NA      NA       NA
215          NA      NA       NA
216          NA      NA       NA
217          NA      NA       NA
218          NA      NA       NA
219          NA      NA       NA
220          NA      NA       NA
221          NA      NA       NA
222          NA      NA       NA
223          NA      NA       NA
224          NA      NA       NA
225          NA      NA       NA
226          NA      NA       NA
227          NA      NA       NA
228          NA      NA       NA
229          NA      NA       NA
230          NA      NA       NA
231          NA      NA       NA
232          NA      NA       NA
233          NA      NA       NA
234          NA      NA       NA
235          NA      NA       NA
236          NA      NA       NA
237          NA      NA       NA
238          NA      NA       NA
239          NA      NA       NA
240          NA      NA       NA
241          NA      NA       NA
242          NA      NA       NA
243          NA      NA       NA
244          NA      NA       NA
245          NA      NA       NA
246          NA      NA       NA
247          NA      NA       NA
248          NA      NA       NA
249          NA      NA       NA
250          NA      NA       NA
251          NA      NA       NA
252          NA      NA       NA
253          NA      NA       NA
254          NA      NA       NA
255          NA      NA       NA
256          NA      NA       NA
257          NA      NA       NA
258          NA      NA       NA
259          NA      NA       NA
260          NA      NA       NA
261          NA      NA       NA
262          NA      NA       NA
263          NA      NA       NA
264          NA      NA       NA
265          NA      NA       NA
266          NA      NA       NA
267          NA      NA       NA
268          NA      NA       NA
269          NA      NA       NA
270          NA      NA       NA
271          NA      NA       NA
272          NA      NA       NA
273          NA      NA       NA
274          NA      NA       NA
275          NA      NA       NA
276          NA      NA       NA
277          NA      NA       NA
278          NA      NA       NA
279          NA      NA       NA
280          NA      NA       NA
281          NA      NA       NA
282          NA      NA       NA
283          NA      NA       NA
284          NA      NA       NA
285          NA      NA       NA
286          NA      NA       NA
287          NA      NA       NA
288          NA      NA       NA
289          NA      NA       NA
290          NA      NA       NA
291          NA      NA       NA
292          NA      NA       NA
293          NA      NA       NA
294          NA      NA       NA
295          NA      NA       NA
296          NA      NA       NA
297          NA      NA       NA
298          NA      NA       NA
299          NA      NA       NA
300          NA      NA       NA
301          NA      NA       NA
302          NA      NA       NA
303          NA      NA       NA
304          NA      NA       NA
305          NA      NA       NA
306          NA      NA       NA
307          NA      NA       NA
308          NA      NA       NA
309          NA      NA       NA
310          NA      NA       NA
311          NA      NA       NA
312          NA      NA       NA
313          NA      NA       NA
314          NA      NA       NA
315          NA      NA       NA
316          NA      NA       NA
317          NA      NA       NA
318          NA      NA       NA
319          NA      NA       NA
320          NA      NA       NA
321          NA      NA       NA
322          NA      NA       NA
323          NA      NA       NA
324          NA      NA       NA
325          NA      NA       NA
326          NA      NA       NA
327          NA      NA       NA
328          NA      NA       NA
329          NA      NA       NA
330          NA      NA       NA
331          NA      NA       NA
332          NA      NA       NA
333          NA      NA       NA
334          NA      NA       NA
335          NA      NA       NA
336          NA      NA       NA
337          NA      NA       NA
338          NA      NA       NA
339          NA      NA       NA
340          NA      NA       NA
341          NA      NA       NA
342          NA      NA       NA
343          NA      NA       NA
344          NA      NA       NA
345          NA      NA       NA
346          NA      NA       NA
347          NA      NA       NA
348          NA      NA       NA
349          NA      NA       NA
350          NA      NA       NA
351          NA      NA       NA
352          NA      NA       NA
353          NA      NA       NA
354          NA      NA       NA
355          NA      NA       NA
356          NA      NA       NA
357          NA      NA       NA
358          NA      NA       NA
359          NA      NA       NA
360          NA      NA       NA
361          NA      NA       NA
362          NA      NA       NA
363          NA      NA       NA
364          NA      NA       NA
365          NA      NA       NA
366          NA      NA       NA
367          NA      NA       NA
368          NA      NA       NA
369          NA      NA       NA
370          NA      NA       NA
371          NA      NA       NA
372          NA      NA       NA
373          NA      NA       NA
374          NA      NA       NA
375          NA      NA       NA
376          NA      NA       NA
377          NA      NA       NA
378          NA      NA       NA
379          NA      NA       NA
380          NA      NA       NA
381          NA      NA       NA
382          NA      NA       NA
383          NA      NA       NA
384          NA      NA       NA
385          NA      NA       NA
386          NA      NA       NA
387          NA      NA       NA
388          NA      NA       NA
389          NA      NA       NA
390          NA      NA       NA
391          NA      NA       NA
392          NA      NA       NA
393          NA      NA       NA
394          NA      NA       NA
395          NA      NA       NA
396          NA      NA       NA
397          NA      NA       NA
398          NA      NA       NA
399          NA      NA       NA
400          NA      NA       NA
401          NA      NA       NA
402          NA      NA       NA
403          NA      NA       NA
404          NA      NA       NA
405          NA      NA       NA
406          NA      NA       NA
407          NA      NA       NA
408          NA      NA       NA
409          NA      NA       NA
410          NA      NA       NA
411          NA      NA       NA
412          NA      NA       NA
413          NA      NA       NA
414          NA      NA       NA
415          NA      NA       NA
416          NA      NA       NA
417          NA      NA       NA
418          NA      NA       NA
419          NA      NA       NA
420          NA      NA       NA
421          NA      NA       NA
422          NA      NA       NA
423          NA      NA       NA
424          NA      NA       NA
425          NA      NA       NA
426          NA      NA       NA
427          NA      NA       NA
428          NA      NA       NA
429          NA      NA       NA
430          NA      NA       NA
431          NA      NA       NA
432          NA      NA       NA
433          NA      NA       NA
434          NA      NA       NA
435          NA      NA       NA
436          NA      NA       NA
437          NA      NA       NA
438          NA      NA       NA
439          NA      NA       NA
440          NA      NA       NA
441          NA      NA       NA
442          NA      NA       NA
443          NA      NA       NA
444          NA      NA       NA
445          NA      NA       NA
446          NA      NA       NA
447          NA      NA       NA
448          NA      NA       NA
449          NA      NA       NA
450          NA      NA       NA
451          NA      NA       NA
452          NA      NA       NA
453          NA      NA       NA
454          NA      NA       NA
455          NA      NA       NA
456          NA      NA       NA
457          NA      NA       NA
458          NA      NA       NA
459          NA      NA       NA
460          NA      NA       NA
461          NA      NA       NA
462          NA      NA       NA
463          NA      NA       NA
464          NA      NA       NA
465          NA      NA       NA
466          NA      NA       NA
467          NA      NA       NA
468          NA      NA       NA
469          NA      NA       NA
470          NA      NA       NA
471          NA      NA       NA
472          NA      NA       NA
473          NA      NA       NA
474          NA      NA       NA
475          NA      NA       NA
476          NA      NA       NA
477          NA      NA       NA
478          NA      NA       NA
479          NA      NA       NA
480          NA      NA       NA
481          NA      NA       NA
482          NA      NA       NA
483          NA      NA       NA
484          NA      NA       NA
485          NA      NA       NA
486          NA      NA       NA
487          NA      NA       NA
488          NA      NA       NA
489          NA      NA       NA
490          NA      NA       NA
491          NA      NA       NA
492          NA      NA       NA
493          NA      NA       NA
494          NA      NA       NA
495          NA      NA       NA
496          NA      NA       NA
497          NA      NA       NA
498          NA      NA       NA
499          NA      NA       NA
500          NA      NA       NA
501          NA      NA       NA
502          NA      NA       NA
503          NA      NA       NA
504          NA      NA       NA
505          NA      NA       NA
506          NA      NA       NA
507          NA      NA       NA
508          NA      NA       NA
509          NA      NA       NA
510          NA      NA       NA
511          NA      NA       NA
512          NA      NA       NA
513          NA      NA       NA
514          NA      NA       NA
515          NA      NA       NA
516          NA      NA       NA
517          NA      NA       NA
518          NA      NA       NA
519          NA      NA       NA
520          NA      NA       NA
521          NA      NA       NA
522          NA      NA       NA
523          NA      NA       NA
524          NA      NA       NA
525          NA      NA       NA
526          NA      NA       NA
527          NA      NA       NA
528          NA      NA       NA
529          NA      NA       NA
530          NA      NA       NA
531          NA      NA       NA
532          NA      NA       NA
533          NA      NA       NA
534          NA      NA       NA
535          NA      NA       NA
536          NA      NA       NA
537          NA      NA       NA
538          NA      NA       NA
539          NA      NA       NA
540          NA      NA       NA
#+end_example

* 2016-03-29 Tracing batch executions along time                      :Lucas:

This follows the same design as in:
- [[*2016-03-29 Tracing batch executions along time][2016-03-29 Tracing batch executions along time]]

The difference is that =ayira= should be instrumented to measure, at _the
end of every batch execution_, the following information:

# Design factors
- input (see [[*2016-03-29 DoE for Batch Size Investigation][2016-03-29 DoE for Batch Size Investigation]])
- batch (see [[*2016-03-29 DoE for Batch Size Investigation][2016-03-29 DoE for Batch Size Investigation]])
# Tracing info
- batch number (starting at 1)
- start time (in microseconds)
- end time (in microseconds)
- size in bytes of the batch
- size in number of operations
# Platform
- Platform

Ideally, each line holds all this information. Note that there might
be many of these lines since it gets registered at every batch
execution, specially when size is 128 operations and file is big. So,
I strongly recommend you buffer this information in a vector and dump
only at the end. The name of the file should be something unique,
combining information above, such as =input_batch_platform.csv=, where
input is big/medium/small, batch is A, B, C and so on. You could use
all columns values as in the design described in [[*2016-03-29 DoE for Batch Size Investigation][2016-03-29 DoE for
Batch Size Investigation]] except for those that you measure (simulation
and insertion times, memory utilization).
* 2016-03-31 Adding the Batch Size manipulation                        :Tais:
** Implementation
- New argument to "mysql" plugin: -batch <max_size> 
  - size is in number of operations, not bytes.
- We have 4 different types of batches, but it is all counted as it
  was one.

** Batch information data structure
- It is a Map<Long, Long[]>, where the key is the time when the batch
  was executed.
- There is no option of finding out the batch size in bytes.
- Key: start time. Value: end time, duration, size in operations
  - size in operations is always the same, but the last one, that will
    be what is left.


* 2016-04-01 Meeting with Tais                                   :Lucas:Tais:

Batch size is measured in two ways:
- number of operations
- in bytes (doubt below)

How to measure the batch size in bytes?
- Count the number of bytes in prepared statements
- Count the number of bytes when customizing statements
- Sum everything to reach the number of bytes for each batch

Problem measuring =memory= utilization in Java. Let's do like this:
- Before each batch execution, we measure the amount of memory in
  bytes like this:
  #+BEGIN_EXAMPLE
  (Runtime.getRuntime().totalMemory() - Runtime.getRuntime().freeMemory())
  #+END_EXAMPLE
- The result is compared against a global =maxMemory= variable. It the
  results is greated, we update =maxMemory=, otherwise we do nothing.
- Doing this we will obtain the maximum memory utilization of the
  program, which we can use to run comparisons according to the
  batch size. We are not sure yet about the resolution of such
  functions, so let's use the data with care.

Measuring time in nanoseconds _for everything_
#+BEGIN_EXAMPLE
System.nanoTime();
#+END_EXAMPLE

Execution time (OKAY)
- Should not consider time spent for DB connection

Print batch size (the argument) to the output
- When no batch is provided, you print the initilization's MAXINT 

_What is missing for launching the experiments?_
- Three input files
- Bash script to run the experiment
  - INPUT: CSV design
  - OUTPUT: CSV design with measurements

#+begin_src sh :results output :session :exports both :tangle Cpp_Comparison.sh
#!/bin/bash

# CPP_Comparison.sh

# For each line
  # get the name of the program (column 5)
  # get the input size (column 6)
  # Launch the experiment, get execution time
  # print the line, with the time.

function usage()
{
  echo "./Cpp_Comparison.sh <design> <platform>";
}


DESIGN=$1
if [ -z "$DESIGN" ]; then
    usage;
    exit;
fi
PLATFORM=$2
if [ -z "$PLATFORM" ]; then
    usage;
    exit
fi

while read -r line; do
    PROGRAM=`echo $line | cut -d, -f5 | sed -e "s/\"//g"`
    INPUTSIZE=`echo $line | cut -d, -f6 | sed -e "s/\"//g"`
    if [[ $PROGRAM = "version" ]]; then
       echo $line
       continue
    fi
    if [[ $INPUTSIZE = "small" ]]; then
      INPUT="trace-128K.paje"
    elif [[ $INPUTSIZE = "medium" ]]; then
      INPUT="trace-128M.paje"
    else 
      INPUT="trace-1G.paje"
    fi
    if [[ $PROGRAM = "aiyra" ]]; then
      # execute aiyra 
      EXEC="$(java br.ufrgs.inf.tlbellini.PajeGrammar -f $INPUT | cut -d: -f2)"
    elif [[ $PROGRAM = "pj" ]]; then
	# execute pj_dump -q -t
	EXEC="$(pj_dump $INPUT --quiet -t)"
    elif [[ $PROGRAM = "pjflex" ]]; then
	# execute pj_dump -q -t -f
      EXEC="$(pj_dump $INPUT --quiet -t -f)"
    fi
    echo $line | cut -d, -f1-6 | tr '\n' ','
    echo "$EXEC,$PLATFORM"
done < "$DESIGN"
#+end_src

#+begin_src sh :results output :session :exports both :tangle Batch_Size_Investigation.sh
#!/bin/bash

# CPP_BatchSize_Investigation.sh

# For each line
  # get the name of the program (column 5)
  # get the input size (column 6)
  # Launch the experiment, get execution time
  # print the line, with the time.

function usage()
{
  echo "./Cpp_Batch_Size_Investigation.sh <design> <platform>";
}


DESIGN=$1
if [ -z "$DESIGN" ]; then
    usage;
    exit;
fi
PLATFORM=$2
if [ -z "$PLATFORM" ]; then
    usage;
    exit
fi

while read -r line; do
    INPUTSIZE=`echo $line | cut -d, -f5 | sed -e "s/\"//g"`
    BATCHSIZE=`echo $line | cut -d, -f6 | sed -e "s/\"//g"`
    EXEC=" "
    if [[ $INPUTSIZE = "input" ]]; then
       echo $line
       continue
    fi
    if [[ $INPUTSIZE = "small" ]]; then
      INPUT="trace-128K.paje"
      MAXBATCH=2727
    elif [[ $INPUTSIZE = "medium" ]]; then
      INPUT="trace-128M.paje"
      MAXBATCH=2526628
    elif [[ $INPUTSIZE = "big" ]]; then 
      INPUT="trace-1G.paje"
      MAXBATCH=19570722
    fi
    if [[ $BATCHSIZE = "A" ]]; then 
      BATCH=$MAXBATCH
      if [[ $INPUTSIZE = "big" ]]; then
        EXEC=NA
        TIME=NA
        TIME_INSERTION=NA
        MAX_MEM=NA
      fi
    elif [[ $BATCHSIZE = "B" ]]; then
      BATCH=$((MAXBATCH/2))
    elif [[ $BATCHSIZE = "C" ]]; then
      BATCH=$((MAXBATCH/4))
    elif [[ $BATCHSIZE = "D" ]]; then
      BATCH=$((MAXBATCH/8))
    elif [[ $BATCHSIZE = "E" ]]; then
      BATCH=$((MAXBATCH/16))
    elif [[ $BATCHSIZE = "F" ]]; then
      BATCH=$((MAXBATCH/32))
    fi
    if [[ $EXEC != NA ]]; then 
      EXEC="$(java br.ufrgs.inf.tlbellini.PajeGrammar -f $INPUT -p mysql -batch $BATCH -test)"
      TIME=`echo $EXEC | cut -d" " -f18`
      TIME_INSERTION=`echo $EXEC | cut -d" " -f8`
      MAX_MEM=`echo $EXEC | cut -d" " -f10`
    fi
    echo $line | cut -d, -f1-6 | tr '\n' ','
    echo "$TIME,$TIME_INSERTION,$MAX_MEM,$PLATFORM"
done < "$DESIGN"
#+end_src

#+RESULTS:
: ./Cpp_Batch_Size_Investigation.sh <design> <platform>


Until Tuesday, you sent me both scripts.
Next Friday, we analyze some data.


* 2016-04-01 Generating traces with different sizes                   :Lucas:

For input, the levels are small (128K), medium (131072K, or 128M), and
big (1048576K or 1G). So, to generate these files, you can use an
example tool called tracegen that I just developed with poti. To
quickly introduce yourself, do:

_Clone and Compile_

#+begin_src sh :results output :session :exports both
git clone https://github.com/schnorr/poti.git
mkdir -p poti/build; cd poti/build
cmake ..; make VERBOSE=yes
#+end_src

#+RESULTS:

_Get to know tracegen_

#+begin_src sh :results output :session :exports both
./poti/build/examples/tracegen --help
#+end_src

#+RESULTS:

As you can see you just have to provide an obligatory filename and an
optional target size. If size is not provided, it will generate the
minimal trace file for this example (see tracegen source code [1] for
details).

[1]: https://github.com/schnorr/poti/blob/master/examples/tracegen.c

_Generating the trace files_

So, to get you trace files, just run the following:

#+begin_src sh :results output :session :exports both
./poti/build/examples/tracegen --filename trace-128K.paje --size `echo 128*1024 | bc -l`
./poti/build/examples/tracegen --filename trace-128M.paje --size `echo 128*1024*1024 | bc -l`
./poti/build/examples/tracegen --filename trace-1G.paje --size `echo 1024*1024*1024 | bc -l`
#+end_src

#+RESULTS:

Great. Let's it. I'm gzipping them to send to you.

#+begin_src sh :results output :session :exports both
gzip trace-128K.paje trace-128M.paje trace-1G.paje; ls -lh *.paje.gz
#+end_src

#+RESULTS:
: -rw-r--r-- 1 schnorr schnorr  40K Apr  1 16:51 trace-128K.paje.gz
: -rw-r--r-- 1 schnorr schnorr  36M Apr  1 16:51 trace-128M.paje.gz
: -rw-r--r-- 1 schnorr schnorr 277M Apr  1 16:52 trace-1G.paje.gz

They are all available here:
- https://dl.dropboxusercontent.com/u/1119921/Traces/trace-128K.paje.gz
- https://dl.dropboxusercontent.com/u/1119921/Traces/trace-128M.paje.gz
- https://dl.dropboxusercontent.com/u/1119921/Traces/trace-1G.paje.gz

You can =gunzip= them.

* 2016-04-02 - Batch Size in bytes
The size of the string is being considered.
* 2016-04-02 21:00 - Status
_What is missing for launching the experiments?_
- Three input files OK
- Bash script to run the experiment
  - INPUT: CSV design
  - OUTPUT: CSV design with measurements
* 2016-04-04 - Bash Scripts
** Cpp_Comparison:
- need -t parameter
- only linux
** Batch_Size_Investigation:
-Mac: max number for "big" exceeds gc overhead limit

* 2016-04-05 - Mac pj_dump
- CMake Error: The following variables are used in this project, but they are set to NOTFOUND.

Please set them or make sure they are set and tested correctly in the CMake files:

FL_LIBRARY (ADVANCED)

    linked by target "paje_library" in directory
   
This happens beacause the ccmake . is not finding the Flex file libfl.a

If you installed Flex using Brew:
brew list flex 
find the path to the "lib" folder: THIS will be the path to the
missing file. 
Go to ccmake . 
find FL_LIBRARY
put the path , adding libfl.a at the end

Compilation errors:
brew install argp-standalone 
libargp.a is not found
brew list argp-standalone
find path to libargp.a
make VERBOSE=yes
execute the full path and instead of -largp put what you found in brew
list argp-standalone
* 2016-04-05 Batch size for each input trace                          :Lucas:

#+begin_src sh :results output :session :exports both
for i in *.paje; do echo -n "$i "; cat $i | grep ^13 | wc -l; done
#+end_src

#+RESULTS:
: trace-128K.paje 2727
: trace-128M.paje 2526628
: trace-1G.paje 19570722

* 2016-04-06 Quick analysis of data =results/guarani/1_tentativa.csv=   :Lucas:

#+begin_src R :results output :session :exports both
  library(dplyr);
  df <- read.csv ("results/guarani/1_tentativa.csv");
  k <- df %>%
       select(version, input, time, platform) %>%
       group_by(version, input, platform) %>%
       summarize(N = n(),
                 time_avg = mean(time),
                 time_se = 3*sd(time)/sqrt(N))
                
  k;
#+end_src

#+RESULTS:
#+begin_example
Source: local data frame [9 x 6]
Groups: version, input

  version  input platform  N     time_avg      time_se
1   aiyra    big  guarani 30           NA           NA
2   aiyra medium  guarani 30           NA           NA
3   aiyra  small  guarani 30           NA           NA
4      pj    big  guarani 30 248.34171373 1.1231438892
5      pj medium  guarani 30  31.99264657 0.1493861801
6      pj  small  guarani 30   0.03451830 0.0002804379
7  pjflex    big  guarani 30 266.65148143 1.6170200167
8  pjflex medium  guarani 30  34.08444947 0.1362978432
9  pjflex  small  guarani 30   0.03641293 0.0003676874
#+end_example

* 2016-04-07 First attempts mac
** Batch
1) reached full memory before completed.
2) Added -test option that erases the data from DB
3) initial memory available: 55 GB
* 2016-04-10 First atempts windows
** Batch
1) initial memory available 398GB

